[
  {
    "id": 5,
    "text": "I appreciate you for finding some time to get us on a date.",
    "date": "12/13/2024"
  },
  {
    "id": 6,
    "text": "I appreciate you taking the time to go to the holiday party and chat with my friends. Means a lot for us to be seen together.",
    "date": "12/15/2024"
  },
  {
    "id": 7,
    "text": "I really appreciate you making my birthday feel special. I know it's at an awkward time of year. So it doesn't go unnoticed that you got everyone together and made it something nice. That massage was one of the best things to happen in the last few months.",
    "date": "12/23/2024"
  },
  {
    "id": 8,
    "text": "I appreciate you making Christmas nice. It's kind of a hard time of year sometimes without having us all together. You still took the time to wrap presents for the boys and even want to wrap the stockings (even though I think it's overkill :). You still do what it takes to make it special for them.",
    "date": "12/23/2024"
  },
  {
    id: 9,
    text: "Thanksgiving was great! The boys had a good time. I always hate that you have to hang back and not fully enjoy dinner the past few year. But I really appreciate you letting me have an opportunity to see Brett and Melissa.",
    date: "12/1/2024"
  },
  {
    "id": 4,
    "text": "I appreciate you for always taking care of our children who aren't biologically yours since day 1 that we moved in together.",
    "date": "11/17/2024"
  },
  {
    "id": 3,
    "text": "Jessi, I appreciate you for how much you do for our family. Your work within our family allows my career to thrive and gives me a sense of calm and peace when I'm at home.",
    "date": "11/17/2024"
  },
  {
    "id": 2,
    "text": "Jessi, I really appreciate coming home to a clean house with a new rug and clean bedding after sleeping on a couch all week!",
    "date": "11/17/2024"
  },
  {
    "id": 1,
    "text": "Jessi, I appreciate hearing your truth even when you are hurt. I know things feel raw sometimes, but I appreciate that you have the courage and trust me enough to share.",
    "date": "11/16/2024"
  }
]
